#+TITLE: storetheindex. Or "who has this CID?"
#+SUBTITLE:[[https://cid.contact/][ cid.contact]]

** Example:
Who can provide data referenced by this CID =bafybeigvgzoolc3drupxhlevdp2ugqcrbcsqfmcek2zxiw5wctk3xjpjwy=?
#+begin_src bash
curl 'https://cid.contact/cid/bafybeigvgzoolc3drupxhlevdp2ugqcrbcsqfmcek2zxiw5wctk3xjpjwy' | jq '.MultihashResults[].ProviderResults[].Provider.ID'
#+end_src

#+RESULTS:
| 12D3KooWDaha2JyiYKqQQbobTva1vX6cnP5HrvwUsv5KPvAQJ1ST |
| 12D3KooWDaha2JyiYKqQQbobTva1vX6cnP5HrvwUsv5KPvAQJ1ST |
| 12D3KooWM4wsQ3kdd8CDHiVDQthU9JZ9KqsxSdSQT2xj6TAdDth5 |
| 12D3KooW9yi2xLhXds9HC4x9vRN99mphq6ds8qN2YRf8zks1F32G |
| 12D3KooWDMJSprsuxhjJVnuQQcyibc5GxanUUxpDzHU74rhknqkU |


*(a hash of some content that serves as its ID) Where does the data come from? On replication and eventual consistency
storetheindex gets its data from providers themselves.

- Each provider publishes an /Advertisement/ that contains the /entries/ (aka CIDs) that it knows it can provide.
- The /Advertisement/ links to a previous /Advertisement/.
- Forms a chain (like a blockchain!)
